backend/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "age", "password_digest") VALUES (?, ?, ?)  [["name", "Gian"], ["age", 26], ["password_digest", "$2a$12$NuoKw87sl08zoHJhdDG9suvMPZpzfFWLtDTh3yC.nH5SKpJULsN2C"]]
---
    def create
      user = User.create(user_params)

SELECT "users".* FROM "users"
SELECT "workouts".* FROM "workouts" WHERE "workouts"."user_id" = ?  [["user_id", 1]]
---
    def index
        render json: User.all, include: [:workouts]

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def find_current_user
        if params[:id]
            @current_user =User.find(params[:id])