backend/app/controllers/workouts_controller.rb

SELECT "workouts".* FROM "workouts"
---
    def index
        render json: Workout.all